function color = MyGet_colors_nok
% 没有（类）黑色
color = num2cell( ...
        [
        "#9999ff" "#0000ff" "#000099" %"#000019"     % 蓝 1
        "#ff99ff" "#ff00ff" "#990099" %"#190019"     % 粉 5
        "#ff9999" "#ff0000" "#990000" %"#190000"     % 红 9
        "#99ff99" "#00ff00" "#009900" %"#001900"     % 绿 13
        "#ffff99" "#ffff00" "#999900" %"#191900"     % 黄 17
        "#99ffff" "#00ffff" "#009999" %"#001919"     % 青 21
        "#ffffff" "#bbbbbb" "#999999" %"#191919"     % 灰 25
        ]' ...  % 这里的转置是必要的, 为了使 MyColors{i} 能先遍历第一行再进入下一行
    );
end